In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = [1, 2, 3])

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [7]:
df[['a','c']]

   a   c
1  4  10
2  5  11
3  6  12

In [8]:
df.loc[1]

a     4
b     7
c    10
Name: 1, dtype: int64

In [10]:
df.loc[3,'b']

9

In [13]:
df.loc[[1,2],['a','c']]

   a   c
1  4  10
2  5  11

In [14]:
df = pd.DataFrame(
    [[4, 7, 10],
    [5, 8, 11],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [15]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [46]:
import numpy as np
df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6, np.nan],
    "b" : [7, 8, np.nan, 9, 9],
    "c" : [10, 11, 12, np.nan, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',2),('e',3),('e',4)],
    names=['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [24]:
df[df.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [26]:
df[df.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [32]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [36]:
df = df.drop_duplicates(keep='last') #중복된 행 제거 시 사용
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [37]:
df.head()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [40]:
df[df['b'] != 7]

     a  b   c
n v
d 2  5  8  11
e 3  6  9  12

In [43]:
df.a.isin([5]) #isin 안에는 list형태로 들어가야 한다

n  v
d  1    False
   2     True
e  3    False
Name: a, dtype: bool

In [45]:
df['a'].isin([6])

n  v
d  1    False
   2    False
e  3     True
Name: a, dtype: bool

In [47]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [54]:
df.isnull()

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [50]:
df['a'].isnull().sum() #null값 개수 확인

1

In [51]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [52]:
df.notnull()

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

* &,|,~,^,df.any(),df.all() 
* Logical and, or, not, xor, any, all

In [56]:
~df.a.notnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [70]:
df.head(3)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [71]:
df.tail(2)

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [81]:
df.sample(frac=0.5)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [83]:
df.sample(n=2)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [87]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [89]:
df.iloc[-2:]

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [90]:
df.iloc[3:]

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [101]:
df = pd.DataFrame({'a': [1, 10, 8, 11, -1],
               'b': list('abcde'),
               'c': [1.0, 2.0, np.nan, 3.0, 4.0]})
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [94]:
df.nlargest(2,'c')

    a  b    c
4  -1  e  4.0
3  11  d  3.0

In [102]:
df.nsmallest(2,'a')

   a  b    c
4 -1  e  4.0
0  1  a  1.0